2.2.013/src/Catalogs/МК_СотрудникиКЭДО/МК_СотрудникиКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>МК_СотрудникиКЭДО</name>
  <comment>Сотрудники, присоединенные к КЭДО</comment>
  <attributes>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьСогласие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

2.2.013/src/InformationRegisters/ДанныеДляПодбораСотрудников/ДанныеДляПодбораСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8048febd-cf83-413d-8677-04e1f791040c">
  <name>ДанныеДляПодбораСотрудников</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources extendedConfigurationObject="a5e069ee-7936-43e5-ba08-369cfef6082e">
    <name>Должность</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="756ae0d9-f1d5-4f90-8a78-f9d59cf66bd0">
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="2348f956-2bde-41ca-a9ce-50267a8ad6a6">
    <name>ФизическоеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="51fb4128-5516-4c0d-9e12-c279879705d6">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

2.2.013/src/InformationRegisters/МК_СотрудникиКЭДО/МК_СотрудникиКЭДО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МК_СотрудникиКЭДО</name>
  <comment>Нужен для связи с динамическим списком в кадровых документах</comment>
  <resources>
    <name>ЕстьСогласие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизическоеЛицоСсылка</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СотрудникСсылка</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

2.2.013/src/Catalogs/МК_СотрудникиКЭДО/ManagerModule.bsl
Функция ПроверитьСогласиеКЭДО(мСотр)  Экспорт
	// Пока проверяем по физлицу.  
	// Сначала ищем в нашем справочнике. Если не нашли - запрос в МК.
	мРез = Ложь;
	мФЛ = мСотр.ФизическоеЛицо;
	мДокСсылка = Справочники.МК_СотрудникиКЭДО.НайтиПоРеквизиту("ФизическоеЛицо", мФЛ);     
	Если Не мДокСсылка.Пустая() Тогда   // Нашли
		мРез = мДокСсылка.ЕстьСогласие;
	КонецЕсли;    
	
	//Возврат мРез;  // Временная заглушка
	
	Если Не мРез Тогда   // Нужно обратиться в МК
		ОО = Обработки.МК_НастройкаВыгрузки.Создать();             // Получили доступ к обработке, в которой находятся служебные функции  
		мСеанс = ОО.СоздатьСеансСвязи(Истина); 
		мСправ = Новый Массив;
		
		// Запрос должен иметь вид:
		//{
  		//"Ids": ["9040260b-1be4-11ea-80f4-d43d7e4c0a31"],
  		//"Type": "individual"
		//}
		
		Если мСеанс = Неопределено Тогда
			// Ошибка авторизации. Ничего не делаем.
		Иначе      
			мСпис = Новый Массив;
			мСпис.Добавить(СокрЛП(мФЛ.УникальныйИдентификатор()));
			мЗапрос = Новый Структура;
			мЗапрос.Вставить("Ids",мСпис);
			//мЗапрос.Вставить("Type","individual");
			
			ЗаписьJSON = Новый ЗаписьJSON;     				
			ЗаписьJSON.УстановитьСтроку();
   			ЗаписатьJSON(ЗаписьJSON, мЗапрос);	
			ТекстJSON = ЗаписьJSON.Закрыть();

			мРезультат = Истина;    // Пока эта истина говорит о том, что сеанс создан (получен токен). 		
			hЗапрос = ОО.СоздатьHTTPЗапрос("/api/1c-exchange/edms/users-consents", мСеанс);    
			hЗапрос.Заголовки.Вставить("Source","1C Enterprise MK");  
			hЗапрос.УстановитьТелоИзСтроки(ТекстJSON);   
			hОтвет = мСеанс.Соединение.ВызватьHTTPМетод("POST", hЗапрос);  
			ТекстОтвет = hОтвет.ПолучитьТелоКакСтроку();
			Попытка
				ЧтениеJSON = Новый ЧтениеJSON;
				ЧтениеJSON.УстановитьСтроку(ТекстОтвет);
				СтрОтвет = ПрочитатьJSON(ЧтениеJSON); 
				Если ТипЗнч(СтрОтвет) <> Тип("Структура")ИЛИ НЕ СтрОтвет.Свойство("data") Тогда
					// Тут какая-то беда. Или структура не получена, или она неправильная  
				Иначе     
					мСправ = СтрОтвет.Data.Items;	
				КонецЕсли;	
			Исключение   
				мОшибка = "Ошибка получения ответа. Не удалось преобразовать строку HTTP-ответа в json: "+ТекстОтвет;  
				Сообщить(мОшибка);
			КонецПопытки;       
			Если мСправ.Количество() >0 Тогда   
				//мКолво = Справочники.МК_СотрудникиКЭДО.ЗаполнитьСправочник(мСправ);
				Если мСправ[0].enable Тогда
					мРез = Истина;
					// Нужно добавить запись в справочник. !!! Пока решил не добавлять. Пусть через одну процедуру обновления справочника все работает.
				КонецЕсли;	
			КонецЕсли;					
		КонецЕсли;	 
	КонецЕсли;	
	Возврат мРез;
КонецФункции

Функция ЗаполнитьСправочник(мСправ) Экспорт  
	// Кроме заполнения справочника, нужно еще заполнять одноименный регистр сведений.
	// В него добавляются ссылка на физлицо и на сотрудника. В дальнейшем связь планируется исключительно
	// по сотруднику. Заполнение выполняется только для добавляемых или изменяемых записей. Если добавили нового
	// сотрудника к уже имеющемуся физлицу, то по нему пока добавление записи будет при попытке создать ему документ КЭДО.
	мКолво = 0;
	Для Каждого мЭлемент Из мСправ Цикл
		мИзменение = Ложь;
		мКод = Строка(мЭлемент.ID);
		мСсылкаФЛ = Справочники.ФизическиеЛица.ПолучитьСсылку(Новый УникальныйИдентификатор(мКод)); 
		Если мСсылкаФЛ.ПолучитьОбъект() <> Неопределено Тогда
			мДокСсылка = Справочники.МК_СотрудникиКЭДО.НайтиПоРеквизиту("ФизическоеЛицо", мСсылкаФЛ);     
			Если Не мДокСсылка.Пустая() Тогда   
				мДок = мДокСсылка.ПолучитьОбъект();
				Если мДок.ЕстьСогласие <> мЭлемент.enable Тогда
					мДок.ЕстьСогласие = мЭлемент.enable;
                    мИзменение = Истина;
				КонецЕсли;
			Иначе     
				мДок = Справочники.МК_СотрудникиКЭДО.СоздатьЭлемент();
				мДок.ФизическоеЛицо = мСсылкаФЛ;
				мДок.ЕстьСогласие = мЭлемент.enable;
				мКолво = мКолво + 1;
				мИзменение = Истина;
			КонецЕсли;
			Если мИзменение Тогда
				мДок.Записать();
				// Надо получить список рабочих мест по ФЛ    
				мВыборка = СписокСотрудниковПоФизлицу(мСсылкаФЛ);
				Пока мВыборка.Следующий() Цикл
					ДобавитьВРегистрСотрКЭДО(мСсылкаФЛ, мВыборка.СотрудникСсылка,мЭлемент.enable);
				КонецЦикла;	
			КонецЕсли;	
		КонецЕсли;	
	КонецЦикла;		
	Возврат мКолво;
КонецФункции	

Функция СписокСотрудниковПоФизлицу(мФизлицо)  Экспорт
	// Подбираем только основных сотрудников или внешних совместителей. 
	// Если все хорошо, должен вернуться один сотрудник.
		
	мЗапрос = Новый Запрос;	
	мЗапрос.УстановитьПараметр("Физлицо", мФизлицо);
	мЗапрос.УстановитьПараметр("Дата", ТекущаяДата());        
	
	мЗапрос.Текст =   
	"ВЫБРАТЬ
	//|	ДанныеДляПодбора.Должность.Ссылка КАК ДолжностьСсылка,
	|	ДанныеДляПодбора.Сотрудник.Ссылка КАК СотрудникСсылка,    
	|	ДанныеДляПодбора.ВидЗанятости КАК ВидЗанятости
	|ИЗ
	|	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбора
	|ГДЕ
	|	ДанныеДляПодбора.ФизическоеЛицо.Ссылка = &Физлицо	
	|	И ДанныеДляПодбора.ВидСобытия <> ЗНАЧЕНИЕ(Перечисление.ВидыКадровыхСобытий.Увольнение)
	//|	И НЕ ДанныеДляПодбора.ПоДоговоруГПХ 
	//|   И (ДанныеДляПодбора.ВидЗанятости = Значение(Перечисление.ВидыЗанятости.ОсновноеМестоРаботы) 
	//|		ИЛИ ДанныеДляПодбора.ВидЗанятости = Значение(Перечисление.ВидыЗанятости.Совместительство))
	|	И ДанныеДляПодбора.Начало <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ДанныеДляПодбора.Начало <= КОНЕЦПЕРИОДА(&Дата, ДЕНЬ)
	|	И (ДанныеДляПодбора.Окончание = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ ДанныеДляПодбора.Окончание >= НАЧАЛОПЕРИОДА(&Дата, ДЕНЬ))";

    РезультатЗапроса = мЗапрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();
			
	Возврат Выборка;

КонецФункции

Процедура ДобавитьВРегистрСотрКЭДО(мСсылкаФЛ, мСотрудникСсылка,мЕстьСогласие)
	МенеджерЗаписи = РегистрыСведений.МК_СотрудникиКЭДО.СоздатьМенеджерЗаписи(); 
	МенеджерЗаписи.ФизическоеЛицоСсылка = мСсылкаФЛ; 
	МенеджерЗаписи.СотрудникСсылка = мСотрудникСсылка; 
	МенеджерЗаписи.ЕстьСогласие = мЕстьСогласие; 
	МенеджерЗаписи.Записать();   
КонецПроцедуры	  

Процедура СоздатьЗаписиРегистраСотрКЭДО() Экспорт    // Времянка - для первичного заполнения регистра по имеющемуся справочнику сотрудников КЭДО
	Выборка = Справочники.МК_СотрудникиКЭДО.Выбрать(); 
	Пока Выборка.Следующий() Цикл;   
		мВыборка = СписокСотрудниковПоФизлицу(Выборка.ФизическоеЛицо);
		Пока мВыборка.Следующий() Цикл                                                           
			ДобавитьВРегистрСотрКЭДО(Выборка.ФизическоеЛицо,мВыборка.СотрудникСсылка,Выборка.ЕстьСогласие); 			
		КонецЦикла;			
	КонецЦикла;	                  
КонецПроцедуры
